In [16]:
import pandas as pb

data = pb.read_csv("../data/train.csv", header=None,encoding='utf-8')
print(data.head(10))
print (data.shape)

            0         1       2   \
0  PassengerId  Survived  Pclass
1            1         0       3
2            2         1       1
3            3         1       3
4            4         1       1
5            5         0       3
6            6         0       3
7            7         0       1
8            8         0       3
9            9         1       3

                                                  3       4    5      6   \
0                                               Name     Sex  Age  SibSp
1                            Braund, Mr. Owen Harris    male   22      1
2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1
3                             Heikkinen, Miss. Laina  female   26      0
4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1
5                           Allen, Mr. William Henry    male   35      0
6                                   Moran, Mr. James    male  NaN      0
7                            McCarthy, Mr. Timothy J    male   54      0
8                     Palsson, Master. Gosta Leonard    male    2      3
9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   27      0

      7                 8        9      10        11
0  Parch            Ticket     Fare  Cabin  Embarked
1      0         A/5 21171     7.25    NaN         S
2      0          PC 17599  71.2833    C85         C
3      0  STON/O2. 3101282    7.925    NaN         S
4      0            113803     53.1   C123         S
5      0            373450     8.05    NaN         S
6      0            330877   8.4583    NaN         Q
7      0             17463  51.8625    E46         S
8      1            349909   21.075    NaN         S
9      2            347742  11.1333    NaN         S
(892, 12)

In [15]:
datax = data.sort_values(by=0, ascending=False)

print (datax.shape)

(892, 12)

In [17]:
data.describe()

,0,1,2,3,4,5,6,7,8,9,10,11
count,892,892,892,892,892,715,892,892,892,892,205,890
unique,892,3,4,892,3,89,8,8,682,249,148,4
top,39,0,3,"Beckwith, Mr. Richard Leonard",male,24,0,0,1601,8.05,G6,S
freq,1,549,491,1,577,30,608,678,7,43,4,644

In [29]:
survived  = data.groupby(2).size()
print (survived)

2
1         216
2         184
3         491
Pclass      1
dtype: int64